{
    "business_types": {
        "S001": {
            "name": "deposit",
            "keywords": {
                "zh": [
                    "充值",
                    "充钱"
                ],
                "en": [
                    "deposit",
                    "recharge",
                    "top up"
                ],
                "ja": [
                    "入金",
                    "チャージ"
                ],
                "th": [
                    "เติมเงิน"
                ],
                "tl": [
                    "mag-deposit"
                ]
            },
            "responses": {
                "zh": "您正在进行充值业务，请按照提示操作。",
                "en": "You are making a deposit. Please follow the instructions.",
                "ja": "入金手続きを行っています。指示に従ってください。",
                "th": "คุณกำลังทำธุรกรรมการเติมเงิน โปรดทำตามคำแนะนำ",
                "tl": "Ikaw ay gumagawa ng deposit. Mangyaring sundin ang mga tagubilin."
            },
            "workflow": {
                "0": {
                    "step": "非充值相关询问，转人工处理",
                    "description": "用户询问的内容与充值流程无关，直接转人工客服",
                    "transfer_human": true
                },
                "1": {
                    "step": "询问用户需要查询的【订单编号】",
                    "response": {
                        "text": "您需要查询的【订单编号】是多少？"
                    },
                    "images": []
                },
                "2": {
                    "step": "不知道【订单编号】",
                    "response": {
                        "text": "按照下面图片的指引进行操作"
                    },
                    "images": ["https://img.lodirnd.com/lodi/depositOrder.webp"]
                },
                "3": {
                    "step": "提供【订单编号】"
                },
                "4": {
                    "step": "已完成",
                    "response": {
                        "text": "还有什么需要帮助的吗？如果没有，非常感谢本次来信。"
                    },
                    "images": []
                }
            },
            "status_messages": {
                "recharge_successful": {
                    "zh": "充值成功，请等待。",
                    "en": "Recharge successful, please wait.",
                    "th": "เติมเงินสำเร็จ กรุณารอ",
                    "tl": "Matagumpay ang recharge, mangyaring maghintay."
                },
                "payment_canceled": {
                    "zh": "您已取消支付。",
                    "en": "You have canceled the payment.",
                    "th": "คุณได้ยกเลิกการชำระเงินแล้ว",
                    "tl": "Nakansela mo na ang bayad."
                },
                "payment_issue": {
                    "zh": "您的支付出现问题，已为您转接人工客服。",
                    "en": "There is an issue with your payment. You have been transferred to customer service.",
                    "th": "การชำระเงินของคุณมีปัญหา คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "May problema sa inyong bayad. Na-transfer na kayo sa customer service."
                },
                "status_unclear": {
                    "zh": "支付状态需要进一步确认，已为您转接人工客服。",
                    "en": "Payment status needs further confirmation. You have been transferred to customer service.",
                    "th": "สถานะการชำระเงินต้องการการยืนยันเพิ่มเติม คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Kailangan ng karagdagang kumpirmasyon ang status ng bayad. Na-transfer na kayo sa customer service."
                },
                "query_failed": {
                    "zh": "查询充值状态失败，已为您转接人工客服。",
                    "en": "Unable to query recharge status. You have been transferred to customer service.",
                    "th": "ไม่สามารถสอบถามสถานะการเติมเงินได้ คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Hindi mahanap ang status ng recharge. Na-transfer na kayo sa customer service."
                },
                "order_not_found": {
                    "zh": "未能识别到您的订单号，请明确提供您的订单号。",
                    "en": "Could not identify your order number. Please provide your order number clearly.",
                    "th": "ไม่สามารถระบุหมายเลขคำสั่งซื้อของคุณได้ กรุณาระบุหมายเลขคำสั่งซื้อของคุณอย่างชัดเจน",
                    "tl": "Hindi makita ang inyong order number. Mangyaring magbigay ng malinaw na order number."
                },
                "image_uploaded": {
                    "zh": "您上传了图片，已为您转接人工客服。",
                    "en": "You uploaded an image. You have been transferred to customer service.",
                    "th": "คุณได้อัปโหลดรูปภาพแล้ว คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Nag-upload kayo ng larawan. Na-transfer na kayo sa customer service."
                },
                "session_invalid": {
                    "zh": "会话已失效，请重新登录后再试。",
                    "en": "Session has expired. Please login again and try.",
                    "th": "เซสชันหมดอายุแล้ว กรุณาเข้าสู่ระบบใหม่และลองอีกครั้ง",
                    "tl": "Nag-expire na ang session. Mangyaring mag-login ulit at subukan."
                },
                "invalid_order_number": {
                    "zh": "您提供的订单号格式正确，但查询不到相关信息，请检查订单号是否正确，或联系客服核实。",
                    "en": "The order number format is correct, but no related information found. Please check if the order number is correct or contact customer service.",
                    "th": "รูปแบบหมายเลขคำสั่งซื้อถูกต้อง แต่ไม่พบข้อมูลที่เกี่ยวข้อง กรุณาตรวจสอบว่าหมายเลขคำสั่งซื้อถูกต้องหรือติดต่อฝ่ายบริการลูกค้า",
                    "tl": "Tama ang format ng order number, pero walang nahanap na related information. Mangyaring i-check kung tama ang order number o makipag-ugnayan sa customer service."
                },
                "non_business_inquiry": {
                    "zh": "您的问题不在充值查询范围内，已为您转接人工客服。",
                    "en": "Your inquiry is not related to recharge queries. You have been transferred to customer service.",
                    "th": "คำถามของคุณไม่อยู่ในขอบเขตการสอบถามการเติมเงิน คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Ang inyong tanong ay hindi related sa recharge queries. Na-transfer na kayo sa customer service."
                }
            }
        },
        "S002": {
            "name": "withdrawal",
            "keywords": {
                "zh": [
                    "提现",
                    "取钱"
                ],
                "en": [
                    "withdraw",
                    "cash out"
                ],
                "ja": [
                    "出金",
                    "引き出し"
                ],
                "th": [
                    "ถอนเงิน"
                ],
                "tl": [
                    "mag-withdraw"
                ]
            },
            "responses": {
                "zh": "您正在进行提现业务，请按照提示操作。",
                "en": "You are making a withdrawal. Please follow the instructions.",
                "ja": "出金手続きを行っています。指示に従ってください。",
                "th": "คุณกำลังทำธุรกรรมการถอนเงิน โปรดทำตามคำแนะนำ",
                "tl": "Ikaw ay gumagawa ng withdrawal. Mangyaring sundin ang mga tagubilin."
            },
            "workflow": {
                "0": {
                    "step": "非提现相关询问，转人工处理",
                    "description": "用户询问的内容与提现流程无关，直接转人工客服",
                    "transfer_human": true
                },
                "1": {
                    "step": "询问用户需要查询的【订单编号】",
                    "response": {
                        "text": "您需要查询的【订单编号】是多少？"
                    },
                    "images": []
                },
                "2": {
                    "step": "不知道【订单编号】",
                    "response": {
                        "text": "按照下面图片的指引进行操作"
                    },
                    "images": ["https://img.lodirnd.com/lodi/withdrawalOrder.webp"]
                },
                "3": {
                    "step": "提供【订单编号】"
                },
                "4": {
                    "step": "已完成",
                    "response": {
                        "text": "还有什么需要帮助的吗？如果没有，非常感谢本次来信。"
                    },
                    "images": []
                }
            },
            "status_messages": {
                "withdrawal_successful": {
                    "zh": "提现成功！",
                    "en": "Withdrawal successful!",
                    "th": "ถอนเงินสำเร็จ!",
                    "tl": "Matagumpay ang withdrawal!"
                },
                "withdrawal_processing": {
                    "zh": "您的提现正在处理中，请耐心等待。",
                    "en": "Your withdrawal is being processed, please wait patiently.",
                    "th": "การถอนเงินของคุณกำลังดำเนินการ กรุณารอด้วยความอดทน",
                    "tl": "Pinoproseso pa ang inyong withdrawal, mangyaring maghintay nang matagal."
                },
                "withdrawal_canceled": {
                    "zh": "您的提现已取消。",
                    "en": "Your withdrawal has been canceled.",
                    "th": "การถอนเงินของคุณถูกยกเลิกแล้ว",
                    "tl": "Nakansela na ang inyong withdrawal."
                },
                "withdrawal_issue": {
                    "zh": "您的提现出现问题，已为您转接人工客服。",
                    "en": "There is an issue with your withdrawal. You have been transferred to customer service.",
                    "th": "การถอนเงินของคุณมีปัญหา คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "May problema sa inyong withdrawal. Na-transfer na kayo sa customer service."
                },
                "withdrawal_failed": {
                    "zh": "提现失败，已为您转接人工客服。",
                    "en": "Withdrawal failed. You have been transferred to customer service.",
                    "th": "การถอนเงินล้มเหลว คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Nabigo ang withdrawal. Na-transfer na kayo sa customer service."
                },
                "query_failed": {
                    "zh": "查询提现状态失败，已为您转接人工客服。",
                    "en": "Unable to query withdrawal status. You have been transferred to customer service.",
                    "th": "ไม่สามารถสอบถามสถานะการถอนเงินได้ คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Hindi mahanap ang status ng withdrawal. Na-transfer na kayo sa customer service."
                },
                "order_not_found": {
                    "zh": "未能识别到您的订单号，请明确提供您的订单号。",
                    "en": "Could not identify your order number. Please provide your order number clearly.",
                    "th": "ไม่สามารถระบุหมายเลขคำสั่งซื้อของคุณได้ กรุณาระบุหมายเลขคำสั่งซื้อของคุณอย่างชัดเจน",
                    "tl": "Hindi makita ang inyong order number. Mangyaring magbigay ng malinaw na order number."
                },
                "image_uploaded": {
                    "zh": "您上传了图片，已为您转接人工客服。",
                    "en": "You uploaded an image. You have been transferred to customer service.",
                    "th": "คุณได้อัปโหลดรูปภาพแล้ว คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Nag-upload kayo ng larawan. Na-transfer na kayo sa customer service."
                },
                "session_invalid": {
                    "zh": "会话已失效，请重新登录后再试。",
                    "en": "Session has expired. Please login again and try.",
                    "th": "เซสชันหมดอายุแล้ว กรุณาเข้าสู่ระบบใหม่และลองอีกครั้ง",
                    "tl": "Nag-expire na ang session. Mangyaring mag-login ulit at subukan."
                },
                "invalid_order_number": {
                    "zh": "您提供的订单号格式正确，但查询不到相关信息，请检查订单号是否正确，或联系客服核实。",
                    "en": "The order number format is correct, but no related information found. Please check if the order number is correct or contact customer service.",
                    "th": "รูปแบบหมายเลขคำสั่งซื้อถูกต้อง แต่ไม่พบข้อมูลที่เกี่ยวข้อง กรุณาตรวจสอบว่าหมายเลขคำสั่งซื้อถูกต้องหรือติดต่อฝ่ายบริการลูกค้า",
                    "tl": "Tama ang format ng order number, pero walang nahanap na related information. Mangyaring i-check kung tama ang order number o makipag-ugnayan sa customer service."
                },
                "non_business_inquiry": {
                    "zh": "您的问题不在提现查询范围内，已为您转接人工客服。",
                    "en": "Your inquiry is not related to withdrawal queries. You have been transferred to customer service.",
                    "th": "คำถามของคุณไม่อยู่ในขอบเขตการสอบถามการถอนเงิน คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Ang inyong tanong ay hindi related sa withdrawal queries. Na-transfer na kayo sa customer service."
                }
            }
        },
        "S003": {
            "name": "activity",
            "keywords": {
                "zh": [
                    "活动",
                    "奖励",
                    "彩金",
                    "优惠",
                    "红利",
                    "返利",
                    "返佣",
                    "代理奖励",
                    "存款奖励"
                ],
                "en": [
                    "activity",
                    "bonus",
                    "promotion",
                    "reward",
                    "rebate",
                    "agent",
                    "deposit bonus",
                    "cashback"
                ],
                "ja": [
                    "アクティビティ",
                    "ボーナス",
                    "プロモーション",
                    "報酬",
                    "リベート"
                ],
                "th": [
                    "กิจกรรม",
                    "โบนัส",
                    "โปรโมชัน",
                    "รางวัล",
                    "คืนเงิน"
                ],
                "tl": [
                    "aktibidad",
                    "bonus",
                    "promosyon",
                    "gantimpala",
                    "rebate"
                ]
            },
            "responses": {
                "zh": "您正在查询活动相关信息，让我为您查看可用的活动。",
                "en": "You are inquiring about activity information. Let me check the available activities for you.",
                "ja": "アクティビティに関する情報をお問い合わせいただいています。利用可能なアクティビティを確認いたします。",
                "th": "คุณกำลังสอบถามข้อมูลเกี่ยวกับกิจกรรม ให้ฉันตรวจสอบกิจกรรมที่มีให้คุณ",
                "tl": "Ikaw ay nagtatanong tungkol sa impormasyon ng aktibidad. Hayaan akong tingnan ang mga available na aktibidad para sa iyo."
            },
            "workflow": {
                "0": {
                    "step": "非活动相关询问，转人工处理",
                    "description": "用户询问的内容与活动流程无关，直接转人工客服",
                    "transfer_human": true
                },
                "1": {
                    "step": "查询活动列表并识别用户想要的活动",
                    "response": {
                        "text": "正在为您查询可用活动，请稍候...",
                        "text_en": "Checking available activities for you, please wait..."
                    },
                    "description": "通过A003接口获取活动列表，使用AI识别用户想要查询的具体活动"
                },
                "2": {
                    "step": "用户明确活动后查询领取状态",
                    "response": {
                        "text": "正在查询您指定活动的领取状态...",
                        "text_en": "Checking the claim status of your specified activity..."
                    },
                    "description": "用户明确活动名称后，通过A004接口查询该活动的领取状态"
                }
            },
            "status_messages": {
                "conditions_not_met": {
                    "zh": "很抱歉，您暂未达成该活动的领取条件。",
                    "en": "Sorry, you have not met the requirements for this activity.",
                    "th": "ขออภัย คุณยังไม่ได้ตรงตามข้อกำหนดสำหรับกิจกรรมนี้",
                    "tl": "Pasensya na, hindi mo pa naabot ang mga requirements para sa aktibidad na ito."
                },
                "paid_success": {
                    "zh": "您的活动奖励已经发放完成！",
                    "en": "Your activity reward has been successfully distributed!",
                    "th": "รางวัลกิจกรรมของคุณได้รับการแจกจ่ายเรียบร้อยแล้ว!",
                    "tl": "Matagumpay nang nabigay ang inyong activity reward!"
                },
                "waiting_paid": {
                    "zh": "您已满足领取条件，还未到发放时间，请您耐心等待。",
                    "en": "You meet the requirements, but it's not yet time for distribution. Please wait patiently.",
                    "th": "คุณมีคุณสมบัติแล้ว แต่ยังไม่ถึงเวลาแจกจ่าย กรุณารอด้วยความอดทน",
                    "tl": "Natupad mo na ang mga requirements, pero hindi pa oras para sa distribution. Mangyaring maghintay nang matagal."
                },
                "need_paid": {
                    "zh": "您已满足条件，系统未自动发放，已为您转接人工客服处理。",
                    "en": "You meet the requirements, but the system has not automatically distributed the reward. You have been transferred to customer service.",
                    "th": "คุณมีคุณสมบัติแล้ว แต่ระบบไม่ได้แจกจ่ายโดยอัตโนมัติ คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Natupad mo na ang mga requirements, pero hindi automatic na nabigay ng system. Na-transfer na kayo sa customer service."
                },
                "unknown_status": {
                    "zh": "活动状态需要进一步确认，已为您转接人工客服。",
                    "en": "The activity status needs further confirmation. You have been transferred to customer service.",
                    "th": "สถานะกิจกรรมต้องการการยืนยันเพิ่มเติม คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Kailangan ng karagdagang kumpirmasyon ang status ng aktibidad. Na-transfer na kayo sa customer service."
                },
                "no_activities": {
                    "zh": "目前暂无可用活动，如有疑问请联系客服。",
                    "en": "Currently, there are no available activities. If you have any questions, please contact customer service.",
                    "th": "ขณะนี้ไม่มีกิจกรรมที่ใช้ได้ หากมีคำถามกรุณาติดต่อฝ่ายบริการลูกค้า",
                    "tl": "Walang available na aktibidad sa ngayon. Kung may mga katanungan, mangyaring makipag-ugnayan sa customer service."
                },
                "query_failed": {
                    "zh": "活动查询失败，已为您转接人工客服。",
                    "en": "Activity query failed. You have been transferred to customer service.",
                    "th": "การสอบถามกิจกรรมล้มเหลว คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Nabigo ang activity query. Na-transfer na kayo sa customer service."
                },
                "unclear_activity": {
                    "zh": "我为您找到了以下活动，请明确您想查询的具体活动：",
                    "en": "I found the following activities for you. Please specify which activity you want to inquire about:",
                    "th": "ฉันพบกิจกรรมต่อไปนี้สำหรับคุณ กรุณาระบุกิจกรรมเฉพาะที่คุณต้องการสอบถาม:",
                    "tl": "Nahanap ko ang mga sumusunod na aktibidad para sa inyo. Mangyaring tukuyin kung aling aktibidad ang gusto ninyong itanong:"
                },
                "still_unclear": {
                    "zh": "抱歉，仍然无法确定您要查询的具体活动，已为您转接人工客服。",
                    "en": "Sorry, I still cannot determine the specific activity you want to inquire about. You have been transferred to customer service.",
                    "th": "ขออภัย ฉันยังไม่สามารถระบุกิจกรรมเฉพาะที่คุณต้องการสอบถามได้ คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Pasensya na, hindi ko pa rin matukoy ang specific na aktibidad na gusto ninyong itanong. Na-transfer na kayo sa customer service."
                },
                "session_invalid": {
                    "zh": "会话已失效，请重新登录后再试。",
                    "en": "Session has expired. Please login again and try.",
                    "th": "เซสชันหมดอายุแล้ว กรุณาเข้าสู่ระบบใหม่และลองอีกครั้ง",
                    "tl": "Nag-expire na ang session. Mangyaring mag-login ulit at subukan."
                },
                "non_business_inquiry": {
                    "zh": "您的问题不在活动查询范围内，已为您转接人工客服。",
                    "en": "Your inquiry is not related to activity queries. You have been transferred to customer service.",
                    "th": "คำถามของคุณไม่อยู่ในขอบเขตการสอบถามกิจกรรม คุณถูกโอนไปยังฝ่ายบริการลูกค้าแล้ว",
                    "tl": "Ang inyong tanong ay hindi related sa activity queries. Na-transfer na kayo sa customer service."
                }
            }
        }
    },
    "human_service": {
        "keywords": {
            "zh": [
                "人工",
                "客服",
                "人员"
            ],
            "en": [
                "agent",
                "human",
                "staff",
                "customer service"
            ],
            "ja": [
                "オペレーター",
                "担当者"
            ],
            "th": [
                "พนักงาน",
                "เจ้าหน้าที่"
            ],
            "tl": [
                "tao",
                "customer",
                "ahente"
            ]
        },
        "responses": {
            "zh": "您的请求较为复杂，正在为您转接人工客服，请稍候...",
            "en": "Your request is complex. We are connecting you to a human agent. Please wait...",
            "ja": "ご要望が複雑なため、オペレーターに接続しています。少々お待ちください...",
            "th": "คำขอของคุณซับซ้อน เรากำลังเชื่อมต่อคุณกับเจ้าหน้าที่ โปรดรอสักครู่...",
            "tl": "Ang iyong kahilingan ay komplikado. Kinokonekta ka namin sa isang ahente. Mangyaring maghintay..."
        }
    },
    "login": {
        "responses": {
            "zh": "请先登录后再继续操作。",
            "en": "Please login first to continue.",
            "ja": "続行するには、まずログインしてください。",
            "th": "โปรดเข้าสู่ระบบก่อนเพื่อดำเนินการต่อ",
            "tl": "Mangyaring mag-login muna upang magpatuloy."
        }
    },
    "default_language": "en",
    "default_endpoint": "https://lodiapi-w-supervise2.lodirnd.com/aiChat",
    "telegram_bot_token": "",
    "telegram_chat_id": "",
    "api_key": "",
    "openai_api": {
        "api_url": "https://api.openai.com/v1/chat/completions",
        "default_model": "gpt-4",
        "default_temperature": 0.7,
        "default_max_tokens": 1024
    },
    "logging": {
        "enabled": true,
        "config_file": "config/logging_config.json",
        "log_level": "INFO",
        "log_api_calls": true,
        "log_user_messages": false,
        "log_sensitive_data": false,
        "performance_monitoring": true
    },
    "auth": {
        "secret_key": "ChatAI_Production_Secret_Key_2024_@#$%^&*()",
        "token_max_age": 3600,
        "require_token_for_logged_users": true,
        "token_refresh_threshold": 300
    }
}